airFoil2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      2;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

//---------------------------------------------------------------------------//


functions
{
//    #includeFunc streamlines
#includeFunc  mag(U);
#includeFunc  probesFluid
}

// ************************************************************************* //
/*libs    ("libfvMotionSolvers.dll" "libturbulenceModels.dll" "libturbulenceModelSchemes.dll" "libfvOptions.$
functions
{

#includeFunc  probesFluid

	writeExtraFieldsInFluid
	{
		libs	("libutilityFunctionObjects.dll");
		objects	(rho);
		type	writeObjects;
		writeOption	anyWrite;
		enabled	true;
		log	true;
		writeControl	writeTime;
		region	fluid;
	}
}
OptimisationSwitches
{
	fileHandler	uncollated;
	fileModificationSkew	0;
	maxMasterFileBufferSize	1.0E9;
	maxThreadFileBufferSize	1.0E9;
	mpiBufferSize	200000000;
}*/
