airFoil2D/system/probesFluid2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (U p);

//region fluid;

probeLocations
(
    (80 40 0.025) (0 20 0.025)


//    (0.001200584643314	0.004749999847263	0.00306166913711)   // Both probes on
//    (0.005591414139777	0.001500000013039	0.001713247417973)  // locations of possible onset

//    (-0.005024417975485 0 		0.0027016931392)
//    (-0.005026997319389 0.0017	       -0.001937804862296)
//    (-0.002721		0.004685	0.002686)

);

// ************************************************************************* //
